{"config": [{"config": {"units": 500, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "batch_input_shape": [null, 784], "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}, {"config": {"units": 500, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}, {"config": {"units": 10, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow"}